{"keras_version": "1.2.1", "config": [{"config": {"output_shape_type": "raw", "function_type": "lambda", "input_dtype": "float32", "arguments": {}, "output_shape": [10, 32, 3], "batch_input_shape": [null, 10, 32, 3], "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\u000ecomma_model.py\u00da\b<lambda>F\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "name": "lambda_1", "trainable": true}, "class_name": "Lambda"}, {"config": {"bias": true, "name": "convolution2d_1", "nb_row": 8, "activity_regularizer": null, "dim_ordering": "tf", "nb_filter": 16, "border_mode": "same", "subsample": [4, 4], "W_constraint": null, "W_regularizer": null, "b_regularizer": null, "init": "glorot_uniform", "nb_col": 8, "b_constraint": null, "trainable": true, "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"bias": true, "name": "convolution2d_2", "nb_row": 5, "activity_regularizer": null, "dim_ordering": "tf", "nb_filter": 32, "border_mode": "same", "subsample": [2, 2], "W_constraint": null, "W_regularizer": null, "b_regularizer": null, "init": "glorot_uniform", "nb_col": 5, "b_constraint": null, "trainable": true, "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"bias": true, "name": "convolution2d_3", "nb_row": 5, "activity_regularizer": null, "dim_ordering": "tf", "nb_filter": 64, "border_mode": "same", "subsample": [2, 2], "W_constraint": null, "W_regularizer": null, "b_regularizer": null, "init": "glorot_uniform", "nb_col": 5, "b_constraint": null, "trainable": true, "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dropout_1", "trainable": true, "p": 0.2}, "class_name": "Dropout"}, {"config": {"name": "activation_1", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"bias": true, "activity_regularizer": null, "name": "dense_1", "W_constraint": null, "output_dim": 512, "W_regularizer": null, "b_regularizer": null, "init": "glorot_uniform", "input_dim": 128, "b_constraint": null, "trainable": true, "activation": "linear"}, "class_name": "Dense"}, {"config": {"name": "dropout_2", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"name": "activation_2", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"bias": true, "activity_regularizer": null, "name": "dense_2", "W_constraint": null, "output_dim": 1, "W_regularizer": null, "b_regularizer": null, "init": "glorot_uniform", "input_dim": 512, "b_constraint": null, "trainable": true, "activation": "linear"}, "class_name": "Dense"}], "class_name": "Sequential"}
