{"keras_version": "1.2.1", "config": [{"config": {"output_shape_type": "raw", "input_dtype": "float32", "function_type": "lambda", "arguments": {}, "output_shape": [15, 54, 3], "name": "lambda_1", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\u000ecomma_model.py\u00da\b<lambda>H\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "batch_input_shape": [null, 15, 54, 3], "trainable": true}, "class_name": "Lambda"}, {"config": {"subsample": [4, 4], "b_constraint": null, "W_constraint": null, "activation": "linear", "nb_row": 8, "bias": true, "nb_filter": 16, "trainable": true, "nb_col": 8, "activity_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "dim_ordering": "tf", "b_regularizer": null, "name": "convolution2d_1", "border_mode": "same"}, "class_name": "Convolution2D"}, {"config": {"subsample": [2, 2], "b_constraint": null, "W_constraint": null, "activation": "linear", "nb_row": 5, "bias": true, "nb_filter": 32, "trainable": true, "nb_col": 5, "activity_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "dim_ordering": "tf", "b_regularizer": null, "name": "convolution2d_2", "border_mode": "same"}, "class_name": "Convolution2D"}, {"config": {"subsample": [2, 2], "b_constraint": null, "W_constraint": null, "activation": "linear", "nb_row": 5, "bias": true, "nb_filter": 64, "trainable": true, "nb_col": 5, "activity_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "dim_ordering": "tf", "b_regularizer": null, "name": "convolution2d_3", "border_mode": "same"}, "class_name": "Convolution2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"p": 0.2, "trainable": true, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_1"}, "class_name": "Activation"}, {"config": {"b_constraint": null, "W_constraint": null, "activation": "linear", "input_dim": 256, "bias": true, "name": "dense_1", "activity_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "b_regularizer": null, "trainable": true, "output_dim": 512}, "class_name": "Dense"}, {"config": {"p": 0.5, "trainable": true, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_2"}, "class_name": "Activation"}, {"config": {"b_constraint": null, "W_constraint": null, "activation": "linear", "input_dim": 512, "bias": true, "name": "dense_2", "activity_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "b_regularizer": null, "trainable": true, "output_dim": 1}, "class_name": "Dense"}], "class_name": "Sequential"}
