{"class_name": "Sequential", "keras_version": "1.2.1", "config": [{"class_name": "Lambda", "config": {"function_type": "lambda", "trainable": true, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\u000ecomma_model.py\u00da\b<lambda>H\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "input_dtype": "float32", "arguments": {}, "name": "lambda_1", "batch_input_shape": [null, 15, 54, 3], "output_shape_type": "raw", "output_shape": [15, 54, 3]}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "trainable": true, "nb_filter": 16, "nb_col": 8, "border_mode": "same", "bias": true, "b_regularizer": null, "activation": "linear", "dim_ordering": "tf", "subsample": [4, 4], "W_constraint": null, "b_constraint": null, "name": "convolution2d_1", "init": "glorot_uniform", "activity_regularizer": null, "nb_row": 8}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "trainable": true, "nb_filter": 32, "nb_col": 5, "border_mode": "same", "bias": true, "b_regularizer": null, "activation": "linear", "dim_ordering": "tf", "subsample": [2, 2], "W_constraint": null, "b_constraint": null, "name": "convolution2d_2", "init": "glorot_uniform", "activity_regularizer": null, "nb_row": 5}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "trainable": true, "nb_filter": 64, "nb_col": 5, "border_mode": "same", "bias": true, "b_regularizer": null, "activation": "linear", "dim_ordering": "tf", "subsample": [2, 2], "W_constraint": null, "b_constraint": null, "name": "convolution2d_3", "init": "glorot_uniform", "activity_regularizer": null, "nb_row": 5}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_1"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}}, {"class_name": "Dense", "config": {"W_regularizer": null, "trainable": true, "b_constraint": null, "bias": true, "b_regularizer": null, "activation": "linear", "input_dim": 256, "output_dim": 512, "W_constraint": null, "name": "dense_1", "init": "glorot_uniform", "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_2"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_2", "activation": "relu"}}, {"class_name": "Dense", "config": {"W_regularizer": null, "trainable": true, "b_constraint": null, "bias": true, "b_regularizer": null, "activation": "linear", "input_dim": 512, "output_dim": 1, "W_constraint": null, "name": "dense_2", "init": "glorot_uniform", "activity_regularizer": null}}]}
