{"config": [{"config": {"batch_input_shape": [null, 16, 32, 3], "trainable": true, "output_shape": [16, 32, 3], "input_dtype": "float32", "function_type": "lambda", "output_shape_type": "raw", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\u000ecomma_model.py\u00da\b<lambda>?\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "arguments": {}, "name": "lambda_1"}, "class_name": "Lambda"}, {"config": {"trainable": true, "subsample": [4, 4], "border_mode": "same", "b_regularizer": null, "init": "glorot_uniform", "dim_ordering": "tf", "W_regularizer": null, "activation": "linear", "activity_regularizer": null, "bias": true, "b_constraint": null, "name": "convolution2d_1", "nb_row": 8, "nb_filter": 16, "W_constraint": null, "nb_col": 8}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_1"}, "class_name": "ELU"}, {"config": {"trainable": true, "subsample": [2, 2], "border_mode": "same", "b_regularizer": null, "init": "glorot_uniform", "dim_ordering": "tf", "W_regularizer": null, "activation": "linear", "activity_regularizer": null, "bias": true, "b_constraint": null, "name": "convolution2d_2", "nb_row": 5, "nb_filter": 32, "W_constraint": null, "nb_col": 5}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_2"}, "class_name": "ELU"}, {"config": {"trainable": true, "subsample": [2, 2], "border_mode": "same", "b_regularizer": null, "init": "glorot_uniform", "dim_ordering": "tf", "W_regularizer": null, "activation": "linear", "activity_regularizer": null, "bias": true, "b_constraint": null, "name": "convolution2d_3", "nb_row": 5, "nb_filter": 64, "W_constraint": null, "nb_col": 5}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"trainable": true, "name": "dropout_1", "p": 0.2}, "class_name": "Dropout"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_3"}, "class_name": "ELU"}, {"config": {"trainable": true, "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "activation": "linear", "input_dim": 128, "bias": true, "b_constraint": null, "W_constraint": null, "init": "glorot_uniform", "name": "dense_1", "output_dim": 512}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_2", "p": 0.5}, "class_name": "Dropout"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_4"}, "class_name": "ELU"}, {"config": {"trainable": true, "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "activation": "linear", "input_dim": 512, "bias": true, "b_constraint": null, "W_constraint": null, "init": "glorot_uniform", "name": "dense_2", "output_dim": 1}, "class_name": "Dense"}], "keras_version": "1.2.0", "class_name": "Sequential"}
